preal97/VMCB/Software/Solarregler STM32F105RBT6/Solarregler STM32F105RBT5/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */

#include "MAX31865.h"
#include "stdio.h"
#include "string.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan1;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

float temperaturSolar = 0.0;
float temperaturSens3 = 0.0;
float temperaturSolarMean = 0.0;
float temperaturBuffer = 0.0;
float temperaturBufferMean = 0.0;

float temperaturSolarMin = 50;
float temperaturBufferMax = 90;

float hysteresisON = 10.0;
float hysteresisOFF = 2.0;

MAX31865_TypeDef MAXSolar;
MAX31865_TypeDef MAXBuffer;
MAX31865_TypeDef MAXSens3;

uint8_t relaisState = 0;

uint8_t controllerActivated = 0;

uint8_t sens3Used = 0;

uint8_t sens3Solar = 0;

uint8_t sens3Buffer = 0;

int onTime = 0;

uint16_t CanBaseAdress = 0x123;


CanRxMsgTypeDef CanRx;
CanTxMsgTypeDef CanTx;
CAN_FilterConfTypeDef filterConfig;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_RTC_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM2_Init(void);
static void MX_CAN1_Init(void);
static void MX_SPI2_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

uint8_t readCanIdDip(void);
void reenableCanInterrupt(CAN_HandleTypeDef* hcan);

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_RTC_Init();
  MX_I2C1_Init();
  MX_TIM2_Init();
  MX_CAN1_Init();
  MX_SPI2_Init();
  /* USER CODE BEGIN 2 */

	// Initialization of the MAX PT100 Chips
	MAXSolar.SPI_Handle = &hspi2;
	MAXSolar.CS_Pin = CS_1_Pin;
	MAXSolar.CS_GPIOx = CS_1_GPIO_Port;
	MAXSolar.RDY_Pin = DRDY_1_Pin;
	MAXSolar.RDY_GPIOx = DRDY_1_GPIO_Port;
	MAXSolar.referenceResistor = 430.0;
	
	MAXSens3.SPI_Handle = &hspi2;
	MAXSens3.CS_Pin = CS_3_Pin;
	MAXSens3.CS_GPIOx = CS_3_GPIO_Port;
	MAXSens3.RDY_Pin = DRDY_3_Pin;
	MAXSens3.RDY_GPIOx = DRDY_3_GPIO_Port;
	MAXSens3.referenceResistor = 430.0;
	
	MAXBuffer.SPI_Handle = &hspi2;
	MAXBuffer.CS_Pin = CS_2_Pin;
	MAXBuffer.CS_GPIOx = CS_2_GPIO_Port;
	MAXBuffer.RDY_Pin = DRDY_2_Pin;
	MAXBuffer.RDY_GPIOx = DRDY_2_GPIO_Port;
	MAXBuffer.referenceResistor = 430.0;
	
	initialize(&MAXSolar, STANDARD_INIT);
	//initialize(&MAXSens3, STANDARD_INIT);
	initialize(&MAXBuffer, STANDARD_INIT);

	
	checkForFaults(&MAXSolar);
	//checkForFaults(&MAXSens3);
	checkForFaults(&MAXBuffer);
	
	/////////////////////////////////////////////////
	
	//CanBaseAdress = readCanIdDip();
	
	// Initialization of CAN Messages and Filter
	hcan1.pTxMsg = &CanTx;
	hcan1.pTxMsg->StdId = CanBaseAdress + 0x1;
	hcan1.pTxMsg->ExtId = 0x0;
	hcan1.pTxMsg->RTR = CAN_RTR_DATA;
	hcan1.pTxMsg->IDE = CAN_ID_STD;
	hcan1.pTxMsg->DLC = 5; //Datenmenge max 8
	
	hcan1.pRxMsg = &CanRx;
	hcan1.pRxMsg->IDE = CAN_ID_STD;
	hcan1.pRxMsg->FIFONumber = CAN_FIFO0;
	hcan1.pRxMsg->FMI = 1;
	
	filterConfig.FilterNumber = 1;
	filterConfig.FilterMode = CAN_FILTERMODE_IDMASK;
	filterConfig.FilterIdLow = (CanBaseAdress | 0x00F) << 5; // wegen Fehler? offset der ID um 5 Bits
	filterConfig.FilterIdHigh = (CanBaseAdress + 0x7) << 5;
	filterConfig.FilterMaskIdLow = (CanBaseAdress + 0xB) << 5;
	filterConfig.FilterMaskIdHigh = 0x0;
	filterConfig.FilterScale = CAN_FILTERSCALE_16BIT;
	filterConfig.FilterFIFOAssignment = CAN_FILTER_FIFO0;
	filterConfig.FilterActivation = ENABLE;
	filterConfig.BankNumber = 14;
	/////////////////////////////////////////////////
	
	
	// Setup Filter
	HAL_CAN_ConfigFilter(&hcan1, &filterConfig);
	
	//Start Interrupt
	HAL_CAN_Receive_IT(&hcan1, CAN_FIFO0);
	
	
	// Timer start
	HAL_TIM_Base_Start_IT(&htim2);
	
	

	
	

  /* USER CODE END 2 */

