preal97/VMCB/Software/Solarregler STM32F105RBT6/Solarregler STM32F105RBT5/Src/main.c
  /*Configure GPIO pins : B1_Pin CS_2_Pin */
  GPIO_InitStruct.Pin = B1_Pin|CS_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : LD2_Pin LD1_Pin CS_1_Pin */
  GPIO_InitStruct.Pin = LD2_Pin|LD1_Pin|CS_1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : DRDY_1_Pin */
  GPIO_InitStruct.Pin = DRDY_1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(DRDY_1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : DRDY_2_Pin */
  GPIO_InitStruct.Pin = DRDY_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(DRDY_2_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : DRDY_3_Pin */
  GPIO_InitStruct.Pin = DRDY_3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(DRDY_3_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : CS_3_Pin */
  GPIO_InitStruct.Pin = CS_3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(CS_3_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : C7_Pin C6_Pin C5_Pin */
  GPIO_InitStruct.Pin = C7_Pin|C6_Pin|C5_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : C4_Pin C3_Pin C2_Pin C1_Pin 
                           C0_Pin */
  GPIO_InitStruct.Pin = C4_Pin|C3_Pin|C2_Pin|C1_Pin 
                          |C0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : PB5 PB6 PB7 */
  GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

uint8_t readCanIdDip(){
	
	uint8_t canIdDip;
	
	// read in the individual DIP ID Pins
	canIdDip = (HAL_GPIO_ReadPin(C0_GPIO_Port, C0_Pin) << 0) | (HAL_GPIO_ReadPin(C1_GPIO_Port, C1_Pin) << 1) | (HAL_GPIO_ReadPin(C2_GPIO_Port, C2_Pin) << 2) | (HAL_GPIO_ReadPin(C3_GPIO_Port, C3_Pin) << 3);
	canIdDip |= (HAL_GPIO_ReadPin(C4_GPIO_Port, C4_Pin) << 4) | (HAL_GPIO_ReadPin(C5_GPIO_Port, C5_Pin) << 5) | (HAL_GPIO_ReadPin(C6_GPIO_Port, C6_Pin) << 6) | (HAL_GPIO_ReadPin(C7_GPIO_Port, C7_Pin) << 7);
	
	return canIdDip;
}


void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef* hcan){
	
	
if(hcan->pRxMsg->StdId == (CanBaseAdress + 0xB)){
	
		if(sens3Used == 0){
			
		hcan->pTxMsg->StdId = (CanBaseAdress);
		hcan->pTxMsg->DLC = 5;
		hcan->pTxMsg->Data[0] = MAXSolar.faultDetected;
	  hcan->pTxMsg->Data[1] = *((uint8_t *) &temperaturSolar);
		hcan->pTxMsg->Data[2] = *(((uint8_t *) &temperaturSolar) + 1);
		hcan->pTxMsg->Data[3] = *(((uint8_t *) &temperaturSolar) + 2);
		hcan->pTxMsg->Data[4] = *(((uint8_t *) &temperaturSolar) + 3);
		HAL_CAN_Transmit(hcan, 10);
		
		} else {
		
		if(sens3Solar && !sens3Buffer){
			
		hcan->pTxMsg->StdId = (CanBaseAdress);
		hcan->pTxMsg->DLC = 5;
		hcan->pTxMsg->Data[0] = MAXSolar.faultDetected | MAXSens3.faultDetected;
	  hcan->pTxMsg->Data[1] = *((uint8_t *) &temperaturSolarMean);
		hcan->pTxMsg->Data[2] = *(((uint8_t *) &temperaturSolarMean) + 1);
		hcan->pTxMsg->Data[3] = *(((uint8_t *) &temperaturSolarMean) + 2);
		hcan->pTxMsg->Data[4] = *(((uint8_t *) &temperaturSolarMean) + 3);
		HAL_CAN_Transmit(hcan, 10);		
					
			}	else {
				
		if(sens3Buffer && !sens3Solar){
			
		hcan->pTxMsg->StdId = (CanBaseAdress);
		hcan->pTxMsg->DLC = 5;
		hcan->pTxMsg->Data[0] = MAXBuffer.faultDetected | MAXSens3.faultDetected;
	  hcan->pTxMsg->Data[1] = *((uint8_t *) &temperaturBufferMean);
		hcan->pTxMsg->Data[2] = *(((uint8_t *) &temperaturBufferMean) + 1);
		hcan->pTxMsg->Data[3] = *(((uint8_t *) &temperaturBufferMean) + 2);
		hcan->pTxMsg->Data[4] = *(((uint8_t *) &temperaturBufferMean) + 3);
		HAL_CAN_Transmit(hcan, 10);	
			
				}
			}		
		}

		hcan->pTxMsg->StdId = (CanBaseAdress + 0x1);
		hcan->pTxMsg->DLC = 5;
		hcan->pTxMsg->Data[0] = MAXBuffer.faultDetected ;
	  hcan->pTxMsg->Data[1] = *((uint8_t *) &temperaturBuffer);
		hcan->pTxMsg->Data[2] = *(((uint8_t *) &temperaturBuffer) + 1);
		hcan->pTxMsg->Data[3] = *(((uint8_t *) &temperaturBuffer) + 2);
		hcan->pTxMsg->Data[4] = *(((uint8_t *) &temperaturBuffer) + 3);
		HAL_CAN_Transmit(hcan, 10);
	
		hcan->pTxMsg->StdId = (CanBaseAdress + 0x2);
		hcan->pTxMsg->DLC = 8;
	  hcan->pTxMsg->Data[0] = *((uint8_t *) &hysteresisON);
		hcan->pTxMsg->Data[1] = *(((uint8_t *) &hysteresisON) + 1);
		hcan->pTxMsg->Data[2] = *(((uint8_t *) &hysteresisON) + 2);
		hcan->pTxMsg->Data[3] = *(((uint8_t *) &hysteresisON) + 3);
		hcan->pTxMsg->Data[4] = *((uint8_t *) &hysteresisOFF);
		hcan->pTxMsg->Data[5] = *(((uint8_t *) &hysteresisOFF) + 1);
		hcan->pTxMsg->Data[6] = *(((uint8_t *) &hysteresisOFF) + 2);
		hcan->pTxMsg->Data[7] = *(((uint8_t *) &hysteresisOFF) + 3);
		HAL_CAN_Transmit(hcan, 10);
	
		hcan->pTxMsg->StdId = (CanBaseAdress + 0x4);
		hcan->pTxMsg->DLC = 1;
	  hcan->pTxMsg->Data[0] = relaisState;
		HAL_CAN_Transmit(hcan, 10);
		
		hcan->pTxMsg->StdId = (CanBaseAdress + 0x5);
		hcan->pTxMsg->DLC = 8;
	  hcan->pTxMsg->Data[0] = *((uint8_t *) &temperaturBufferMax);
		hcan->pTxMsg->Data[1] = *(((uint8_t *) &temperaturBufferMax) + 1);
		hcan->pTxMsg->Data[2] = *(((uint8_t *) &temperaturBufferMax) + 2);
		hcan->pTxMsg->Data[3] = *(((uint8_t *) &temperaturBufferMax) + 3);
		hcan->pTxMsg->Data[4] = *((uint8_t *) &temperaturSolarMin);
		hcan->pTxMsg->Data[5] = *(((uint8_t *) &temperaturSolarMin) + 1);
		hcan->pTxMsg->Data[6] = *(((uint8_t *) &temperaturSolarMin) + 2);
		hcan->pTxMsg->Data[7] = *(((uint8_t *) &temperaturSolarMin) + 3);
		HAL_CAN_Transmit(hcan, 10);
			
		hcan->pTxMsg->StdId = (CanBaseAdress + 0x6);
		hcan->pTxMsg->DLC = 1;
	  hcan->pTxMsg->Data[0] = *((uint8_t *) &controllerActivated);
		HAL_CAN_Transmit(hcan, 10);

