preal97/VMCB/Software/Solarregler STM32F105RBT6/Solarregler STM32F105RBT5/Src/main.c
}	


if(hcan->pRxMsg->StdId == (CanBaseAdress + 0x3)){
	float tmpON;
	float tmpOFF;
	uint8_t * ON = (uint8_t *) &tmpON;
	uint8_t * OFF = (uint8_t *) &tmpOFF;

	
	*ON = hcan->pRxMsg->Data[0];
	*(ON + 1) = hcan->pRxMsg->Data[1];
	*(ON + 2) = hcan->pRxMsg->Data[2];
	*(ON + 3) = hcan->pRxMsg->Data[3];

	*OFF = hcan->pRxMsg->Data[4];
	*(OFF + 1) = hcan->pRxMsg->Data[5];
	*(OFF + 2) = hcan->pRxMsg->Data[6];
	*(OFF + 3) = hcan->pRxMsg->Data[7];
	
	if(tmpON <= MAX_ADJUSTABLE_TEMPERATURE && tmpON >= MIN_ADJUSTABLE_TEMPERATURE){
		hysteresisON = tmpON;
	} else {
		if(tmpON > MAX_ADJUSTABLE_TEMPERATURE){
			hysteresisON = MAX_ADJUSTABLE_TEMPERATURE;
		}
		if(tmpON < MIN_ADJUSTABLE_TEMPERATURE){
			hysteresisON = MIN_ADJUSTABLE_TEMPERATURE;
		}
	}

	
	if(tmpOFF <= MAX_ADJUSTABLE_TEMPERATURE && tmpOFF >= MIN_ADJUSTABLE_TEMPERATURE){
		hysteresisOFF = tmpOFF;
	} else {
		if(tmpOFF > MAX_ADJUSTABLE_TEMPERATURE){
			hysteresisOFF = MAX_ADJUSTABLE_TEMPERATURE;
		}
		if(tmpOFF < MIN_ADJUSTABLE_TEMPERATURE){
			hysteresisOFF = MIN_ADJUSTABLE_TEMPERATURE;
		}
	}
	
	
		hcan->pTxMsg->StdId = (CanBaseAdress + 0x2);
		hcan->pTxMsg->DLC = 8;
	  hcan->pTxMsg->Data[0] = *((uint8_t *) &hysteresisON);
		hcan->pTxMsg->Data[1] = *(((uint8_t *) &hysteresisON) + 1);
		hcan->pTxMsg->Data[2] = *(((uint8_t *) &hysteresisON) + 2);
		hcan->pTxMsg->Data[3] = *(((uint8_t *) &hysteresisON) + 3);
		hcan->pTxMsg->Data[4] = *((uint8_t *) &hysteresisOFF);
		hcan->pTxMsg->Data[5] = *(((uint8_t *) &hysteresisOFF) + 1);
		hcan->pTxMsg->Data[6] = *(((uint8_t *) &hysteresisOFF) + 2);
		hcan->pTxMsg->Data[7] = *(((uint8_t *) &hysteresisOFF) + 3);
		HAL_CAN_Transmit(hcan, 10);
	
}
	
if(hcan->pRxMsg->StdId == (CanBaseAdress + 0x7)){
	float tmpMAX;
	float tmpMIN;
	uint8_t * MAX = (uint8_t *) &tmpMAX;
	uint8_t * MIN = (uint8_t *) &tmpMIN;
	
	*MAX = hcan->pRxMsg->Data[0];
	*(MAX + 1) = hcan->pRxMsg->Data[1];
	*(MAX + 2) = hcan->pRxMsg->Data[2];
	*(MAX + 3) = hcan->pRxMsg->Data[3];

	*MIN = hcan->pRxMsg->Data[4];
	*(MIN + 1) = hcan->pRxMsg->Data[5];
	*(MIN + 2) = hcan->pRxMsg->Data[6];
	*(MIN + 3) = hcan->pRxMsg->Data[7];
	
	
		if(tmpMAX <= MAX_ADJUSTABLE_TEMPERATURE && tmpMAX >= MIN_ADJUSTABLE_TEMPERATURE){
		temperaturBufferMax = tmpMAX;
		} else {
		if(tmpMAX > MAX_ADJUSTABLE_TEMPERATURE){
			temperaturBufferMax = MAX_ADJUSTABLE_TEMPERATURE;
		}
		if(tmpMAX < MIN_ADJUSTABLE_TEMPERATURE){
			temperaturBufferMax = MIN_ADJUSTABLE_TEMPERATURE;
		}
	}
		
		if(tmpMIN <= MAX_ADJUSTABLE_TEMPERATURE && tmpMIN >= MIN_ADJUSTABLE_TEMPERATURE){
		temperaturSolarMin = tmpMIN;
		} else {
		if(tmpMIN > MAX_ADJUSTABLE_TEMPERATURE){
			temperaturSolarMin = MAX_ADJUSTABLE_TEMPERATURE;
		}
		if(tmpMIN < MIN_ADJUSTABLE_TEMPERATURE){
			temperaturSolarMin = MIN_ADJUSTABLE_TEMPERATURE;
		}
	}
	
	
		hcan->pTxMsg->StdId = (CanBaseAdress + 0x5);
		hcan->pTxMsg->DLC = 8;
	  hcan->pTxMsg->Data[0] = *((uint8_t *) &temperaturBufferMax);
		hcan->pTxMsg->Data[1] = *(((uint8_t *) &temperaturBufferMax) + 1);
		hcan->pTxMsg->Data[2] = *(((uint8_t *) &temperaturBufferMax) + 2);
		hcan->pTxMsg->Data[3] = *(((uint8_t *) &temperaturBufferMax) + 3);
		hcan->pTxMsg->Data[4] = *((uint8_t *) &temperaturSolarMin);
		hcan->pTxMsg->Data[5] = *(((uint8_t *) &temperaturSolarMin) + 1);
		hcan->pTxMsg->Data[6] = *(((uint8_t *) &temperaturSolarMin) + 2);
		hcan->pTxMsg->Data[7] = *(((uint8_t *) &temperaturSolarMin) + 3);
		HAL_CAN_Transmit(hcan, 10);
	
}

if(hcan->pRxMsg->StdId == (CanBaseAdress + 0x8)){
	
	controllerActivated = hcan->pRxMsg->Data[0];
	
		hcan->pTxMsg->StdId = (CanBaseAdress + 0x6);
		hcan->pTxMsg->DLC = 1;
	  hcan->pTxMsg->Data[0] = *((uint8_t *) &controllerActivated);
		HAL_CAN_Transmit(hcan, 10);
	
}
	
	
	reenableCanInterrupt(hcan);
	
}


void reenableCanInterrupt(CAN_HandleTypeDef* hcan){
	
		if(hcan->State == HAL_CAN_STATE_BUSY_TX){
			hcan->State = HAL_CAN_STATE_BUSY_TX_RX0; 
		} else {
			hcan->State = HAL_CAN_STATE_BUSY_RX0;
			hcan->ErrorCode = HAL_CAN_ERROR_NONE;
		
			__HAL_CAN_ENABLE_IT(hcan, CAN_IT_EWG);		
			__HAL_CAN_ENABLE_IT(hcan, CAN_IT_EPV);
			__HAL_CAN_ENABLE_IT(hcan, CAN_IT_BOF);
			__HAL_CAN_ENABLE_IT(hcan, CAN_IT_LEC);
			__HAL_CAN_ENABLE_IT(hcan, CAN_IT_ERR);
			__HAL_CAN_ENABLE_IT(hcan, CAN_IT_EWG);
		
	}
	
	__HAL_CAN_ENABLE_IT(hcan, CAN_IT_FMP0);
	
}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
